p1:  add physical interfaces to ospf
Step 1: Configure addressing and loopbacks
Rl# configure terminal
R1(config)# interface Loopback1
R1(config-if)# description Engineering Department
R1(config-if)# ip address 10.1.1.1 255.255.255.0
R1(config-if)# exit
Rl(config)# interface FastEthernet0/0
R1(config-if)# ip address 10.1.200.1 255.255.255.0
R1(config-if)# no shutdown
R2# conligure terminal
R2(config)# interface Loopback2
R2(config-if)# description Marketing Department
R2(config-if)# ip address 10.1.2.1 255.255.255.0
R2(config-if)# exit
R2(config)# interface FastEthernet0/0
R2(config-if)# ip address 10.1.200.2 255.255.255.0
R2(config-if)# no shutdown
R3# configure terminal
R3(config)# interface Loopback3
R3(config-if)# description Accounting Department
R3(config-if)# ip address 10.1.3.1 255.255.255.0
R3(config-if)# exit
R3(config)# interface FastEthernet0/0
R3(config-if)# ip address 10.1.200.3 255.255.255.0
R3(config-if)# no shutdown
R1(config)# interface Serial 0/0/0
R1(config-if)#f ip address 10.1.100.1 255.255.255.0
R1(config-if)# clockrate 64000
R1(config-if)#f bandwidth 64
R1(config-if)#f no shutdowna
R2(config)#f interface Serial 0/0/0
R2(config-if)# ip address 10.1.100.2 255.255.255.0
R2(config-i0)#â‚© bandwidth 64
R2(config-if)# no shutdown

Step 2: Add physical interfaces to OSPF
Rl(config)# router ospf1
R1(config-router)# network 10.1.100,0 0.0,0.255 area 0
Rl(config-router)# network 10.1.200.0 0.0.0.255 area 0
Rl(config-router)# end
Rl#
R1# debug ip ospfadj Coptional)
OSPF adjacency events debugging is on
R2(config)# router ospf1
R2(config-router)# network 10.1.100.0 0.0.0.255 area 0
R2(config-router)# network 10.1.200.0 0.0.0.255 area 0
R3(config)# router ospf1
R3(config-router)# network 10.1.200.0 0.0.0.255 area 0
Rl#show ip protocols
Routing Protocol is "ospf 1"
Router ID 10.1.1.1
Number of areas in this router is 1. 1 normal 0 stub 0 nssa
Maximum path: 4
Routing for Networks:
10.1.100.0 0.0.0.255 area 0
10.1.200.1 0.0.0.0 area 0
Gateway Distance Last Update
Distance: (default is 110)
R1#show ip ospf
Routing Process "ospf 1" with ID 10.1.1.1
Rl# show ip ospf neighbor
Neighbor ID Pri State Dead Time Address Interface
10.1.2.1 1 FULL/BDR 00:00:36 10.1.200.2 FastEthernet0/0
10.1.3.1 1 FULL/DR 00:00:35 10.1.200.3 FastEthernet0/0
10.1.2.1 0 FULL/ - 00:00:36 10.1.100.2 Serial0/0/0
R1# show ip ospfinterface FastEthernet 0/0
R1# show ip ospf database
Step 4: Add loopback interfaces to OSPF.
R1,R2,R3# show ip route
R1(config)# routef ospf 1
R1(config-router)# network 10.1.1.0 0.0.0.255 area 0
R2(config)# router ospf 1
R2(config-router)# network 10.1.2.0 0.0.0.255 area 0
R3(config)# router ospf 1
R3(config-router)# network 10.1.3.0 0.0.0.255 area 0
R1,R2,R3# show ip route
10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O 10.1.2.1/32 [1 10/2] via 10.1.200.2, 00:00:03, FastEthernet0/0
O 10.1.3.1/32 [110/2] via 10.1.200.3, 00:00:03, FastEthernet0/0
C10.1.1.0/24 is directly connected, Loopback

Rl# show ip ospfinterface Lo1
Loopbackl is up, line protocol is up
Internet Address 10.1.1.1/24, Area 0
Process ID 1, Router ID 10.1.1.1, Network 'Type LOOPBACK, Cost: 1
Loopback interface is treated as a stub Host
R1(config-if)# ip ospf network point-to-point
R2(config)# interface loopback2
R2(config-if)# ip ospf network point-to-point
R3(config)# interface loopback3
R3(config-if)# ip ospf network point-to-point
Rl# show ip route
Step 5: Modify OSPF link costs.
R1(config)# interface FastEthernet 0/0
R1(config-if)# ip ospf cost 50
R2(config)# interface FastEthernet 0/0
R2(config-if)# ip ospf cost 50
R3(config)# interface FastEthernet 0/0
R3(config-if)# ip ospf cost 50
R1# show ip route
10.0.0.0/24 is subnetted,5 subnets
O 10.1.3.0 [110/51] via 10.1.200.3, 00:01:40, FastEthernet0/0
O 10.1.2.0 [1 10/51] via 10.1.200.2, 00:01:40, FastEthernet0/0
Step 6: Modify interface priorities to control the DR and BDR election.
R1(config)# interface FastEthernet 0/0
R1(config-if)# ip ospf priority 10
R2(config)# interface FastEthernet 0/0
R2(config-if)# ip ospf priority 5
Rl# show ip ospf neighbor detail
Neighbor 10.1.2.1, interface address 10.1.200.2
In the area 0 via interface FastEthernet0/0
Neighbor priority is 5, State is FULL, 12 state changes
DR is 10.1.200.1 BDR is 10.1.200.2