p2: ospf virtual link n area summ

Step 1: Configure addressing and loopbacks.
R1# configure terminal
R1(config)# interface loopback 1
R1(config-if)# description Engineering Department
R1(config-if)# ip address 10.1.1.1 255.255.255.0
R1(config-iD)# interface loopback 30
R1(config-if)#ip address 172.30.30.1 255.255.255.252
R1(config-if)# interface serial 0/0/0
R1(config-if)# ip address 10.1.12.1 255.255.255.0
R1(config-if)# clockrate 64000
R1(config-if)#no shutdown
R2# configure terminal
R2(config)# interface loopback 2
R2(config-if)# description Marketing Department
R2(config-if)# ip address 10.1.2.1 255.255.255.0
R2(config-if)# interface serial 0/0/0
R2(config-if)# ip address 10.1.12.2 255.255.255.0
R2(config-if)#no shutdown
R2(config-if)# interface serial 0/0/1
R2(config-if)# ip address 10.1.23.2 255.255.255.0
R2(config-if)# clockrate 64000
R2(config-if)# no shutdown
R3# configure terminal
R3(config)# interface loopback 3
R3(config-if)# description Accounting Department
R3(config-if)# ip address 10.1.3.1 255.255.255.0
R3(config-if)# interface loopback 100
R3(config-if)# ip address 192,168.100.1 255.255.255.0
R3(config-if)# interface loopback 101
R3(config-if)# ip address 192.168.101.1 255.255.255.0
R3(config-if)# interface loopback 102
R3(config-if)# ip address 192.168.102.1 255.255.255.0
R3(config-if)# interface loopback 103
R3(config-if)# ip address 192.168.103.1 255.255.255.0
R3(config-if)# interface serial 0/0/1
R3(config-if)# ip address 10.1.23.3 255.255.255.0
R3(config-if)# no shutdown
Step 2: Add interfaces into OSPF.
R1(config)# router ospf 1
R1(config-router)# network 10.1.12.0 0.0.0.255 area 0
R1(config-router)# network 10.1.1.0 0.0.0.255 area 0
R1(config-router)# exit
R1(config)# interface loopback 1
R1(config-if)# ip ospf network point-to-point

R2(contig)# router ospf 1
R2(config-router)# network 10.1.12.0 0.0.0.255 area 0
R2(config-router)# network 10.1.2.0 0.0.0.255 area O
R2(config-router)#exit
R2(config)#interface loopback 2
R2(config-if)# ip ospf network point-to-point
R1,R2# show ip ospf neighbour
R1,R2# show ip route
R2(config)# router ospf 1
R2(config-router)# network 10.1.23.0 0.0.0.255 area 23
R3(config)# router ospf1
R3(config-router)# network 10.1.23.0 0.0.0.255 area area 23
R3(config-router)# network 10.1.3.0 0.0.0.255 area 23
R3(config-router)#exit
R3(config)#interface loopback 3
R3(config-if)# ip ospfnetwork point-to-point
R2# show ip ospf neighbour
Step 3: Create a virtual link.
R3(config)# router ospf 1
R3(config-router)# network 192.168.100.0 0.0.3.255 area 100
R3(config-router)#exit
R3(config)# interface loopback 100
R3(config-if)# ip ospf network point-to-point
R3(config-if)# interface loopback 101
R3(config-if)# ip ospf network point-to-point
R3(config-if)#interface loopback 102
R3(config-if)# ip ospf network point-to-point
R3(config-if)# interface loopback 103
R3(config-if)# ip ospf network point-to-point
R2# show ip route
R2#show ip ospf
Routing Process "ospf 1' with ID 10.1.2.1
R3# show ip ospf
Routing Process "ospf 1" with ID 192.168.103.1
R2(config)# router ospf 1
R2(config-router)# area 23 virtual-link 192.168.103.1
R3(config)# router ospf 1
R3(config-router)# area 23 virtual-link 10.1.2.1
R2# show ip route
R2# show ip ospf neighbour
R2# show ip ospf interface
OSPF_VL0 is up, line protocol is up
Step 4: Summarize an area.
R3(config)# router ospf1
R3(config-router)# area 100 range 192.168.100.0 255.255.252.0
R2# show ip route
R2# show ip ospf database
R3#show ip route
Step 5: Generate a default route into OSPF
R1(config)# router ospf 1
R1(config-router)# default-information originate always
R2,R3# show ip route
R3# ping 172.30.30.1
