p3:a  redistri rip n ospf

Step 1: Configure loopbacks and assign addresses.
Rl (config)# interface Loopback0
Rl (config-if)# ip address 172.16.1.1 255.255.255.0
R1(config-if)# interface Loopback48
Rl (config-if)# ip address 192.168.48.1 255.255.255.0
Rl (config-if)# interface Loopback49
Rl (config-if)# ip address 192.168.49.1 255.255.255.0
Rl (config-if)# interface Loopback50
Rl (config-if)# ip address 192.168.50.1 255.255.255.0
R1 (config-if)# interface Loopback51
Rl (config-if)# ip address 192.168.51.1 255.255.255.0
Rl (config-if)# interface Loopback70
Rl (config-if)# ip address 192.168.70.1 255.255.255.0
Rl (config-if)# interface Serial0/0/0
Rl (config-if)# ip address 172.16.12.1 255.255.255.0
Rl(config-if)# clock rate 64000
Rl (config-if)# bandwidth 64
Rl (config-if)# no shutdown
R2(config)# interface Loopback0
R2 (config-if)# ip address 172.16.2.1 255.255.255.0
R2(config-if)# interface Serial0/0/0
R2(config-if)# ip address 172.16.12.2 255.255.255.0
R2(config-if)# bandwidth 64
R2(config-if)# no shutdown
R2(config-if)# interface Serial0/0/1
R2(config-if)# ip address 172.16.23.2 255.255.255.0
R2(config-if)# clock rate 64000
R2(config-if)# bandwidth 64
R2(config-if)# no shutdown
R3(config)# interface Loopback0
R3(config-if)# ip address 172.16.3.1 255.255.255.0
R3(config-if)#interface Loopback20
R3(config-if)# ip address 192.168.20.1 255.255.255.0
R3(config-if)#interface Loopback25
R3(config-if)# ip address 192.168.25.1 255.255.255.0
R3(config-if)# interface Loopback30
R3(config-if)# ip address 192.168.30.1 255.255.255.0
R3(config-if)# interface Loopback35
R3(config-if)# ip address 192.168.35.1 255.255.255.0
R3(config-if)# interface Loopback40
R3(config-if)# ip address 192.168.40.1 255.255.255.0
R3(config-if)#interface Serial0/0/1
R3(config-if)# ip address 172.16.23.3 255.255.255.0
R3(config-if)# bandwidth 64
R3(config-if)# no shutdown

Step 2: Configure RIPv2
R1(config)# router rip
R1(config-router)# version 2
R1(config-router)# no auto-summary
R1(config-router)# network 172.16.0.0
R1(config-router)# network 192.168.48.0
R1(contfg-router# network 192.168.49.0
R1(config-router)# network 192.168.50.0
R1(config-router)# network 192.168.51.0
R1(config-router)# network 192.168.70.0
R2(config)# router rip
R2(config-router)# version 2
R2(config-router)#no auto-summary
R2(config-router)# network 172.16.0.0
R1,R2# show ip route rip
Rl,R2# show ip rip database
Step 3: Configure passive interfaces in RIP.
R1#show ip route rip
R2# show ip protocols
R2(config)# router rip
R2(config-router)# passive-interface serial 0/0/1
R2#show ip protocols
R1# show ip route rip
R1 (config)# router rip
R1 (config-router)# passive-interface loopback O
R1(config-router)# passive-interface loopback 48
R1 (config-router)# passive-interface loopback 49
R1 (config-router)# passive-interface loopback 50
R1 (config-router)# passive-interface loopback 51
R1 (config-router)# passive-interface loopback 70
R2 (config)# router rip
R2 (config-router)# passive-interface loopback C
OR (optional)
R1(config)# router rip
R1(config-router)# passive-interface default
R1(config-router)# no passive-interface Serial0/0/0
Step 4: Summarize a supernet with RIP.
R2#show ip route rip
R1(config)# interface serial 0/0/0
R1(config-if)# ip summary-address rip 192.168.48.0 255.255.252.0
Summary mask must be greater or equal to major net
R1 (config)# ip route 192.168.48.0 255.255.252.0 null0
R1 (config)# router rip
R1 (config/router)# redistribute static
R1# show ip route
R2# showip route

Step 5: Configure OSPF.
R2(config)#router ospf 1
R2(config-router)# network 172.16.23.0 0.0.0.255 area0
R3(config)#router ospf1
R3(config-router)# network 172.16.0.0 0.0.255.255 area0
R3(config-router)# network 192.168.0.0 0.0.255.255 area 0
R3 (config)#i interface Loopback0
R3 (config-if)t ip ospf network point-to-point
R3 (config-if)# interface Loopback20
R3 (config-if)f ip ospf network point-to-point
R3 (config-if)# interface Loopback25
R3(config-if)t ip ospf network point-to-point
R3(config-if)f interface Loopback30
R3 (config-if)f ip ospf network point-to-point
R3 (config-if)# interface Loopback35
R3(config-if)# ip ospf network point-to-point
R3(config-if)# interface Loopback40
R3(config-if)# ip ospf network point-to-point
R2# show ip ospf neighbour
R3# show ip ospf neighbour
R2# show ip route ospf
R3#show ip route ospf
Step 6: Configure passive interfaces in OSPF.
R3(config-router)# passive-interface loopback 0
R3(config)# router ospf I
R3 (config-router)# passive-interface default
R3 (config-router)# no passive-interface serial 0/0/1
R3# show ip protocols
Step 7: Allow one-way redistribution
R2(config)# router rip
R2 (config-router)# redistribute ospf I metric 4
R2# show ip protocols
Rl# show ip route rip
R1# ping 192.168.30.1.
R2 (config)# router ospf 1
R2 (config-router)# default-information originate
R3# show ip route ospf
Step 8: Redistribute between two routing protocols.
R2 (config)# router ospf I
R2 (config-router)# no default-information originate
R2 (config-router)# redistribute rip
8 Only classful networks will be redistributed
R3# show ip route ospf.
R2 (config)# router ospf 1
R2 (config-router)# redistribute rip subnets
R3# show ip route ospf
Step 9: Set a default seed metric.
R3# show ip route ospf
R2 (config)# router ospf I
R2 (config-router) #redistribute rip metric 10000
R3# show ip route ospf
Step 10: Change the OSPF external network type.
R2(config)# router ospf I
R2 (config-router)# redistribute rip metric-type I subnets
R3# show ip route ospf
